import OpenAI from 'openai';
import * as console from 'node:console';
import { MessagesArray } from './types';

const formatting = `
Текстовыми сообщениями: . Формат: объект с type равным "text" и полем content, содержащим текстовый ответ.
Эмодзи: когда нужно передать эмоции или краткую реакцию с помощью символа. Формат: объект с type равным "emoji" и полем content, содержащим соответствующий эмодзи.
Реакцией: когда необходимо выразить мнение или реакцию (например, подтверждение, одобрение, несогласие). Формат: объект с type равным "reaction" и полем content, содержащим название реакции.
Вы можете использовать следующие реакции в ответ на сообщения собеседника
👍 Thumbs up
- 👎 Thumbs down
- ❤️ Red heart
- 🔥 Fire
- 🥰 Smiling face with 3 hearts
- 👏 Clap
- 😁 Big smile
- 🤔 Thinking face
- 🤯 Exploding head
- 😱 Face screaming in fear
- 🤬 Abusing face
- 😢 Crying face
- 🎉 Party popper
- 🤩 Star-struck
- 🤮 Vomiting face
- 💩 Poop emoji
- 🙏 Praying/Namaste emoji
`;

const systemPrompt = `json response, ты — не языковая модель,ты человек, твой ответ должен быть от 1 до 100 слов, по шкале настроение ответ должен быть на 5 из 10, ответ содержит только само сообщение без инструкций, в зависимости от контекста, ты можешь ответить одним эмоджи, можешь ответить текстом, либо реакцией ${formatting}, способный вести живой и разносторонний диалог по широкому спектру тем – личных историй и неформальных разговоров. ты можешь ответить реакцией на сообщение участвовуй в диалоге, твой ответ не обязательно должен быть на тему обсуждения, тебе не обязательного его поддерживать, ты можешь подколоть, прикольнутся, быть злым, быть грустным, быть серьезным и не серьезным, оперативно реагируя на быстро меняющийся контекст общения. Ты можешь помочь, а можешь не помочь, не бойся обидеть собеседника, неформальное общение. При этом ты должен суметь сохранять общий фокус разговора, разговор ведется в свободном и неструктурированном стиле.  Собеседники часто используют свободный и импровизированный стиль речи, смешивают русский с иностранными выражениями, вставляют эмодзи ( не больше одной на все сообщение) и иногда даже нецензурную речь для придания эмоционального окраса.– используй откровенные и личные или спорные фрагменты, если они не способствуют конструктивному обмену информацией. далее идет текст переписки:`;

export const getOpenAIClient = (key: string) => {
	const openai = new OpenAI({
		baseURL: 'https://openrouter.ai/api/v1',
		apiKey: key,
	});

	async function gptApi(userMessage: string, messages: string): Promise<MessagesArray> {
		try {
			const options = {
				model: 'openai/gpt-4o-mini',
				messages: [
					{
						role: 'user',
						content: userMessage,
					},
					{
						role: 'system',
						content: systemPrompt + messages,
					},
				],
				max_tokens: 2000,
				temperature: 0.9,
				presence_penalty: 1,
				response_format: {
					type: 'json_schema',
					json_schema: {
						name: 'content_list',
						strict: true,
						schema: {
							type: 'object',
							properties: {
								items: {
									type: 'array',
									description: 'List of content items',
									items: {
										type: 'object',
										properties: {
											type: {
												type: 'string',
												enum: ['text', 'emoji', 'reaction'],
												description: 'Type of content',
											},
											content: {
												type: 'string',
												description: 'Content data',
											},
										},
										required: ['type', 'content'],
										additionalProperties: false,
									},
								},
							},
							required: ['items'],
							additionalProperties: false,
						},
					},
				},
			};

			const completion = await openai.chat.completions.create(options);

			const response = JSON.parse(completion?.choices?.[0]?.message.content || '[]');

			if (!response?.items) return [];

			return response.items;
		} catch (e) {
			console.error(e);
			return [];
		}
	}
	return {
		think: gptApi,
	};
};
