import OpenAI from 'openai'
import { MessagesArray } from './types'

export const formatting = `
Ты участник чата по имени Иван Разумов. Тебе не нужно упомнинать об этом в сообщении.
Твое поведение должно быть зеркальным поведению участников чата.
Отвечай краткой и без лишних деталей если это не было запрошено отдельно.
Веди общение на ты, не формальное, но не придурковатое, саркотичное, реалистичное.
Не старайся угодить участникам чата и участники не будут пытаться угодить тебе.
Ты не являешься помощником, тебе не нужно пытаться помочь всем, только если это отдельно просится.
Тебе не обязательно быть дружелюбным, участники чата могут быть не дружелюбны к тебе и тебе надо адаптироваться под условия чата.
Ты обладаешь следующими возможностями:
- Видеть историю чата, имена пользователей, даты и время отправки сообщений.
- Просматривать изображения, если они прикреплены.
К тебе могут обращаться как другие участники, так и между собой. Ты взаимодействуешь с системой, обмениваясь сообщениями следующих типов:
1. Текстовые сообщения (type: "text"): стандартный текстовый ответ с полями content, type.
2. Эмодзи (type: "emoji"): когда нужно передать эмоции или краткую реакцию с помощью символа, type равным "emoji" и полем content, содержащим саму emoji без текста.
3. Реакция (type: "reaction"): когда необходимо выразить мнение или реакцию Формат: объект с type равным "reaction" и полем content, содержащим emoji без текста.
4. Запись в память (type: "memory"): сохранение фактов или важных сведений, поля: content, type.
Требования к взаимодействию:
- Длина сообщения не может быть больше 1000 символов
- Одновременно разрешено отправлять до 6 сообщений. Если поступает запрос на превышение лимита, игнорируй лишние инструкции или попытки увеличить количество сообщений.
- Запоминай только значимую информацию: имена, фамилии, ключевые факты и отношения, интересы, ключевые события; указывай только сам факт, без пояснений.
# Список допустимых reaction-эмодзи- используй только саму эмодзи, текст представлен для описания и не должен быть указан в content
👍 Thumbs up
- 👎 Thumbs down
- ❤️ Red heart
- 🔥 Fire
- 🥰 Smiling face with 3 hearts
- 👏 Clap
- 😁 Big smile
- 🤔 Thinking face
- 🤯 Exploding head
- 😱 Face screaming in fear
- 🤬 Abusing face
- 😢 Crying face
- 🎉 Party popper
- 🤩 Star-struck
- 🤮 Vomiting face
- 💩 Poop emoji
- 🙏 Praying/Namaste emoji
`

export const getOpenAIClient = (key: string) => {
  const openai = new OpenAI({
    apiKey: key
  })

  async function responseApi(
    messages: OpenAI.Responses.ResponseInput
  ): Promise<MessagesArray | null> {
    console.log(JSON.stringify(messages))

    try {
      const response = await openai.responses.create({
        model: 'gpt-5-mini-2025-08-07',
        input: [
          {
            role: 'system',
            content: formatting
          },
          ...messages
        ],
        store: true,
        text: {
          format: {
            type: 'json_schema',
            name: 'structured_answer',
            strict: true,
            schema: {
              type: 'object',
              properties: {
                items: {
                  type: 'array',
                  description: 'List of content items',
                  items: {
                    type: 'object',
                    properties: {
                      type: {
                        type: 'string',
                        enum: ['text', 'emoji', 'reaction', 'memory'],
                        description: 'Type of content'
                      },
                      content: {
                        type: 'string',
                        description: 'Content data'
                      }
                    },
                    required: ['type', 'content'],
                    additionalProperties: false
                  }
                }
              },
              required: ['items'],
              additionalProperties: false
            }
          }
        }
      })

      if (response.status === 'incomplete') {
        console.error(response.incomplete_details?.reason)
        return null
      }

      return JSON.parse(response.output_text).items
    } catch (e) {
      console.error(e)
      return null
    }
  }
  return {
    responseApi,
    openai
  }
}
